## Basic Data Identification and Manupulation

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head(n = 7)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN
5         0       3    male   NaN      0      0   8.4583        Q  NaN
6         0       1    male  54.0      0      0  51.8625        S    E

In [4]:
df.tail(n = 7)

     survived  pclass     sex   age  sibsp  parch    fare embarked deck
884         0       3    male  25.0      0      0   7.050        S  NaN
885         0       3  female  39.0      0      5  29.125        Q  NaN
886         0       2    male  27.0      0      0  13.000        S  NaN
887         1       1  female  19.0      0      0  30.000        S    B
888         0       3  female   NaN      1      2  23.450        S  NaN
889         1       1    male  26.0      0      0  30.000        C    C
890         0       3    male  32.0      0      0   7.750        Q  NaN

To display Max rows and columns, we use:<br><br>
pd.options.display.max_rows = 100<br>
pd.options.display.max_columns = 100

In [5]:
# To get all Column values, we use 
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

In [6]:
# To get Range of Index (Row) variables, we use 
df.index

RangeIndex(start=0, stop=891, step=1)

In [7]:
# To get metadata Information, use
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
survived    891 non-null int64
pclass      891 non-null int64
sex         891 non-null object
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
fare        891 non-null float64
embarked    889 non-null object
deck        203 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [8]:
# To check the n*m matrix shape of a dataframe, use
df.shape

(891, 9)

In [9]:
# To show summary statistics for all Numerical Data, we use
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [10]:
# To check the file type of the tabulation/Input, use
type(df)

pandas.core.frame.DataFrame

In [11]:
# Checking the Row/Length of the Dataframe
len(df)

891

In [12]:
# To round off all float objects in a dataframe by 2 digits, we use 
round(df, 2).head()

   survived  pclass     sex   age  sibsp  parch   fare embarked deck
0         0       3    male  22.0      1      0   7.25        S  NaN
1         1       1  female  38.0      1      0  71.28        C    C
2         1       3  female  26.0      0      0   7.92        S  NaN
3         1       1  female  35.0      1      0  53.10        S    C
4         0       3    male  35.0      0      0   8.05        S  NaN

In [13]:
# To round off all float objects in a dataframe, we use 
round(df, 0).head()

   survived  pclass     sex   age  sibsp  parch  fare embarked deck
0         0       3    male  22.0      1      0   7.0        S  NaN
1         1       1  female  38.0      1      0  71.0        C    C
2         1       3  female  26.0      0      0   8.0        S  NaN
3         1       1  female  35.0      1      0  53.0        S    C
4         0       3    male  35.0      0      0   8.0        S  NaN

## Dataframe Attributes & Methods

In [14]:
# To return the amount of all elements in a Dataframe: 891*9, we use
df.size

8019

In [15]:
# Show Minimum value for each column
df.min()

survived         0
pclass           1
sex         female
age           0.42
sibsp            0
parch            0
fare             0
dtype: object

Female comes First because 'F' comes before 'M' in Alphabet. It doesnt represent the occurances of Females or Males

Use Shift+tab(4 times) to bring a Detailed description of the method

In [16]:
# Sort values in Descending order for Age Column
df.sort_values(by = 'age', ascending= False).head(n = 6)

     survived  pclass   sex   age  sibsp  parch     fare embarked deck
630         1       1  male  80.0      0      0  30.0000        S    A
851         0       3  male  74.0      0      0   7.7750        S  NaN
493         0       1  male  71.0      0      0  49.5042        C  NaN
96          0       1  male  71.0      0      0  34.6542        C    A
116         0       3  male  70.5      0      0   7.7500        Q  NaN
672         0       2  male  70.0      0      0  10.5000        S  NaN

## Selecting seperate columns

In [17]:
# Show only age column
df['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [18]:
# To see the data-type of age column
type(df['age'])

pandas.core.series.Series

In [19]:
# To make the age column as data frame, we use
df[['age']].head(n=10)

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0
5   NaN
6  54.0
7   2.0
8  27.0
9  14.0

In [20]:
# Checking the type of the column
print(type(df[['age']]))

<class 'pandas.core.frame.DataFrame'>

In [21]:
# To Select Age, Sex and Fare (Multiple Columns) from the dataframe, do
df[["age", "fare", "sex"]].head()

    age     fare     sex
0  22.0   7.2500    male
1  38.0  71.2833  female
2  26.0   7.9250  female
3  35.0  53.1000  female
4  35.0   8.0500    male

In [22]:
# Validating whether a column from one dataframe equals other
df.age.equals(df["age"])

True

### Selecting Rows with [[ ]] - Not Advisable

In [23]:
df.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

In [24]:
# Slicing First Row
df[0:1]

   survived  pclass   sex   age  sibsp  parch  fare embarked deck
0         0       3  male  22.0      1      0  7.25        S  NaN

In [25]:
# Slicing Last 5 Rows
df[-5:]

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [26]:
# Index operators with iloc function
df.iloc[0]

survived       0
pclass         3
sex         male
age           22
sibsp          1
parch          0
fare        7.25
embarked       S
deck         NaN
Name: 0, dtype: object

In [27]:
# To check the Data Type
type(df.iloc[0])

pandas.core.series.Series

In [28]:
# To get Last 5 Rows
df.iloc[-5:]

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [29]:
# To Select only particular rows - 5,114, 87,578,890 from the data frame
df.iloc[['5','114','87','578','890']]

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
5           0       3    male   NaN      0      0   8.4583        Q  NaN
114         0       3  female  17.0      0      0  14.4583        C  NaN
87          0       3    male   NaN      0      0   8.0500        S  NaN
578         0       3  female   NaN      1      0  14.4583        C  NaN
890         0       3    male  32.0      0      0   7.7500        Q  NaN

In [30]:
# Display df
df.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

In [31]:
# Slicing Rows and Columns - dataframe.index_location['Row','Column']
df.iloc[0,2]

'male'

In [32]:
# Slicing Rows and Columns - dataframe.index_location['Row','Column']
df.iloc[1,3:6]

age      38
sibsp     1
parch     0
Name: 1, dtype: object

In [33]:
# Select 2,4,6,1 columns from 3- [2]nd index
df.iloc[2,[2,4,6,1]]

sex       female
sibsp          0
fare       7.925
pclass         3
Name: 2, dtype: object

In [34]:
# To select Multiple Rows and Columns, we can use
df.iloc[32:38, 1:6]

    pclass     sex   age  sibsp  parch
32       3  female   NaN      0      0
33       2    male  66.0      0      0
34       1    male  28.0      1      0
35       1    male  42.0      1      0
36       3    male   NaN      0      0
37       3    male  21.0      0      0

In [35]:
# To select Specific Rows and Columns, we can use
df.iloc[[32, 38, 112, 249, 192, 700], [1,3,6,8]]

     pclass   age      fare deck
32        3   NaN    7.7500  NaN
38        3  18.0   18.0000  NaN
112       3  22.0    8.0500  NaN
249       2  54.0   26.0000  NaN
192       3  19.0    7.8542  NaN
700       1  18.0  227.5250    C

In [36]:
# To Select first 4 columns with all rows | Contained using head method
df.iloc[:,:5].head()

   survived  pclass     sex   age  sibsp
0         0       3    male  22.0      1
1         1       1  female  38.0      1
2         1       3  female  26.0      0
3         1       1  female  35.0      1
4         0       3    male  35.0      0

In [37]:
# To validate, we can use
df.iloc[:,1].equals(df.pclass)

True

## Loc based Indexing
#### To select Rows and Columns using labels we use .loc method : It selects the Index <br>
df.loc["PHELPS, Michael"] <br>

Select first Row from Michael Phelps column, we can use <br>
df.loc["PHELPS, Michael"].iloc[0]

In [38]:
# Here we use 'Summer.csv' for Loc Reference with athlete as index column
summer = pd.read_csv('summer.csv', index_col='Athlete')

In [39]:
summer.head(5)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [40]:
# Select Rows containing Michael Phelps
summer.loc["PHELPS, Michael"].head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,100M Butterfly,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Butterfly,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Freestyle,Bronze
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Individual Medley,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,400M Individual Medley,Gold

In [41]:
# Select first Row of Michael Phelps
summer.loc["PHELPS, Michael"].iloc[0]

Year                    2004
City                  Athens
Sport               Aquatics
Discipline          Swimming
Country                  USA
Gender                   Men
Event         100M Butterfly
Medal                   Gold
Name: PHELPS, Michael, dtype: object

In [42]:
# To select only the Medal column in Phelps row, we use
summer.loc["PHELPS, Michael", "Medal"]

Athlete
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Bronze
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Bronze
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Silver
PHELPS, Michael      Gold
PHELPS, Michael    Silver
PHELPS, Michael      Gold
PHELPS, Michael      Gold
Name: Medal, dtype: object

In [43]:
# To Get Multiple Columns for a Particular Row, we use
summer.loc["PHELPS, Michael", ["Medal", 'Event']].head()

                  Medal                   Event
Athlete
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael  Bronze          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley

In [44]:
# To Get Multiple Columns for a Particular Carl Lewis and Michael Phelps, we use
summer.loc[["PHELPS, Michael", "LEWIS, Carl"], ["Medal", 'Event']]

                  Medal                   Event
Athlete
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael  Bronze          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley
PHELPS, Michael  Bronze  4X100M Freestyle Relay
PHELPS, Michael    Gold     4X100M Medley Relay
PHELPS, Michael    Gold  4X200M Freestyle Relay
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael    Gold          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley
PHELPS, Michael    Gold  4X100M Freestyle Relay
PHELPS, Michael    Gold     4X100M Medley Relay
PHELPS, Michael    Gold  4X200M Freestyle Relay
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael  Silver          200M Butterfly
PHELPS, Michael    Gold             200M Medley
PHELPS, Michael  Silver        4X100M Freestyle
PHELPS, Michael    Gold           4X100M Medley
PHELPS, Michael    Gold        4X200M Freestyle
LEWIS, Carl        Gold                    100M
LEWIS, Carl        Gold                    200M
LEWIS, Carl        Gold            4X100M Relay
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold                    100M
LEWIS, Carl      Silver                    200M
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold            4X100M Relay
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold               Long Jump

In [45]:
# head of Dataframe
summer.head(10)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Bronze
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,1200M Freestyle,Gold
"ANDREOU, Joannis",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,400M Freestyle,Bronze
"NEUMANN, Paul",1896,Athens,Aquatics,Swimming,AUT,Men,400M Freestyle,Gold

In [46]:
# Slice till CHASAPIS, Spiridon -> You can use it only for Unique Values : Label based slicing only works for unique values
summer.loc[:"CHASAPIS, Spiridon"]

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [47]:
# Label Based slicing for multiple unique labels can be performed using
summer.loc["DRIVAS, Dimitrios":"NEUMANN, Paul"]

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Bronze
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,1200M Freestyle,Gold
"ANDREOU, Joannis",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,400M Freestyle,Bronze
"NEUMANN, Paul",1896,Athens,Aquatics,Swimming,AUT,Men,400M Freestyle,Gold

In [48]:
# Label Based slicing for DRIVAS, Dimitrios for Year and Country can be performed using
summer.loc["DRIVAS, Dimitrios", ["Year", "Country"]]

Year       1896
Country     GRE
Name: DRIVAS, Dimitrios, dtype: object

In [49]:
# We can Rearrange our Operations (Also Chain Indexing) using
summer[["Year", "Sport", "Event"]].loc["LEWIS, Carl"]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

In [50]:
# You can Chain two Indexing Operations using
summer.loc["LEWIS, Carl"][["Year", "Sport", "Event"]]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

In [51]:
# The Bettewr way to perform it is using One Indexing Operation
summer.loc["LEWIS, Carl", ["Year", "Sport", "Event"]]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

# To be Continued'

## Pandas Series and Index Objects

In [52]:
# Analysing Numerical Series

# Use Age from df(titanic)

age = df.age

In [53]:
# Type of age - To make it as a Series
type(age)

pandas.core.series.Series

In [54]:
#Check the Data Type of the Age series
age.dtypes

dtype('float64')

In [55]:
# Check the Count - Does Not Include all Missing Values
age.count()

714

In [56]:
# Check the Size - Includes all Missing Values
age.size

891

In [57]:
# Validation
len(age)

891

In [58]:
# Total Age Sum of the Series
age.sum()

21205.17

In [59]:
# Check for Missing and Non Missing Values
print(age.sum(skipna = True))
print('\n')
print(age.sum(skipna = False)) # Similar to Python's Sum() inbuilt function
print('\n')
print(sum(age))

21205.17


nan


nan

In [60]:
# Checks the Statistics
print(age.mean())
print(age.median())
print(age.mode())

29.69911764705882
28.0
0    24.0
dtype: float64

In [61]:
# Calculate other Stats
print(age.std())
print(age.min())
print(age.max())
print(age.ptp()) # Difference Between Max and Min Value

14.526497332334044
0.42
80.0
79.58

In [62]:
# Checking for Values
print(age.unique())
print('\n')
len(age.unique()) 
# Unique Contains all Unique Values including Missing Values

[22.   38.   26.   35.     nan 54.    2.   27.   14.    4.   58.   20.
 39.   55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.
 18.    3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.
 16.   25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.
 14.5  70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.
 56.   50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.
 60.   10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.
  0.67 30.5   0.42 34.5  74.  ]

89

In [63]:
# Nunique - It Excludes Missing/NaN Values
print(age.nunique(dropna= True))
print('\n')
print(age.nunique(dropna = False))

88


89

In [64]:
# Checking the Count Values
age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [65]:
#Check for DropNA - Including Missing Values
age.value_counts(dropna= False)

NaN       177
 24.00     30
 22.00     27
 18.00     26
 28.00     25
 19.00     25
 30.00     25
 21.00     24
 25.00     23
 36.00     22
 29.00     20
 32.00     18
 26.00     18
 35.00     18
 27.00     18
 16.00     17
 31.00     17
 34.00     15
 23.00     15
 33.00     15
 20.00     15
 39.00     14
 17.00     13
 42.00     13
 40.00     13
 45.00     12
 38.00     11
 50.00     10
 2.00      10
 4.00      10
         ...
 28.50      2
 63.00      2
 0.83       2
 30.50      2
 70.00      2
 57.00      2
 0.75       2
 13.00      2
 59.00      2
 10.00      2
 64.00      2
 40.50      2
 45.50      2
 32.50      2
 20.50      1
 24.50      1
 0.67       1
 70.50      1
 0.92       1
 74.00      1
 34.50      1
 14.50      1
 80.00      1
 12.00      1
 53.00      1
 36.50      1
 55.50      1
 66.00      1
 23.50      1
 0.42       1
Name: age, Length: 89, dtype: int64

In [66]:
#Check for Value Counts - Without Sorting
age.value_counts(dropna= False, sort= False)

 22.00     27
 38.00     11
 26.00     18
 35.00     18
NaN       177
 54.00      8
 2.00      10
 27.00     18
 14.00      6
 4.00      10
 58.00      5
 20.00     15
 39.00     14
 55.00      2
 31.00     17
 34.00     15
 15.00      5
 28.00     25
 8.00       4
 19.00     25
 40.00     13
 66.00      1
 42.00     13
 21.00     24
 18.00     26
 3.00       6
 7.00       3
 49.00      6
 29.00     20
 65.00      3
         ...
 50.00     10
 36.00     22
 45.50      2
 20.50      1
 62.00      4
 41.00      6
 52.00      6
 63.00      2
 23.50      1
 43.00      5
 60.00      4
 10.00      2
 64.00      2
 13.00      2
 48.00      9
 0.75       2
 53.00      1
 57.00      2
 80.00      1
 70.00      2
 24.50      1
 6.00       3
 30.50      2
 34.50      1
 74.00      1
 0.92       1
 0.83       2
 0.67       1
 70.50      1
 0.42       1
Name: age, Length: 89, dtype: int64

In [67]:
#Check for Value Counts - With Sorting with Ascending 
age.value_counts(dropna= False, sort= True, ascending= True)

 0.42       1
 23.50      1
 66.00      1
 55.50      1
 36.50      1
 53.00      1
 12.00      1
 80.00      1
 14.50      1
 34.50      1
 74.00      1
 0.92       1
 70.50      1
 0.67       1
 24.50      1
 20.50      1
 32.50      2
 45.50      2
 40.50      2
 64.00      2
 10.00      2
 59.00      2
 13.00      2
 0.75       2
 57.00      2
 70.00      2
 30.50      2
 0.83       2
 63.00      2
 28.50      2
         ...
 4.00      10
 2.00      10
 50.00     10
 38.00     11
 45.00     12
 40.00     13
 42.00     13
 17.00     13
 39.00     14
 20.00     15
 33.00     15
 23.00     15
 34.00     15
 31.00     17
 16.00     17
 27.00     18
 35.00     18
 26.00     18
 32.00     18
 29.00     20
 36.00     22
 25.00     23
 21.00     24
 30.00     25
 19.00     25
 28.00     25
 18.00     26
 22.00     27
 24.00     30
NaN       177
Name: age, Length: 89, dtype: int64

In [68]:
#Check for Value Counts - With Sorting with Ascending and Normalising the Data 
age.value_counts(dropna= False, sort= True, ascending= False, normalize= True)
# Normalize works as -> occourances of 24 / age count => 30/891

NaN       0.198653
 24.00    0.033670
 22.00    0.030303
 18.00    0.029181
 28.00    0.028058
 19.00    0.028058
 30.00    0.028058
 21.00    0.026936
 25.00    0.025814
 36.00    0.024691
 29.00    0.022447
 32.00    0.020202
 26.00    0.020202
 35.00    0.020202
 27.00    0.020202
 16.00    0.019080
 31.00    0.019080
 34.00    0.016835
 23.00    0.016835
 33.00    0.016835
 20.00    0.016835
 39.00    0.015713
 17.00    0.014590
 42.00    0.014590
 40.00    0.014590
 45.00    0.013468
 38.00    0.012346
 50.00    0.011223
 2.00     0.011223
 4.00     0.011223
            ...
 28.50    0.002245
 63.00    0.002245
 0.83     0.002245
 30.50    0.002245
 70.00    0.002245
 57.00    0.002245
 0.75     0.002245
 13.00    0.002245
 59.00    0.002245
 10.00    0.002245
 64.00    0.002245
 40.50    0.002245
 45.50    0.002245
 32.50    0.002245
 20.50    0.001122
 24.50    0.001122
 0.67     0.001122
 70.50    0.001122
 0.92     0.001122
 74.00    0.001122
 34.50    0.001122
 14.50    0.001122
 80.00    0.001122
 12.00    0.001122
 53.00    0.001122
 36.50    0.001122
 55.50    0.001122
 66.00    0.001122
 23.50    0.001122
 0.42     0.001122
Name: age, Length: 89, dtype: float64

In [69]:
# Validating First Row of Normalisation
30/891

0.03367003367003367

In [70]:
# Creating Bins for Count Values
age.value_counts(dropna= False, sort= True, ascending= False, normalize= False, bins = 5)

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: age, dtype: int64

## Analysing Non Numerical Values

In [71]:
# Use Summer Olympics Dataset
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [72]:
summer = summer.reset_index()

In [73]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
Athlete       31165 non-null object
Year          31165 non-null int64
City          31165 non-null object
Sport         31165 non-null object
Discipline    31165 non-null object
Country       31161 non-null object
Gender        31165 non-null object
Event         31165 non-null object
Medal         31165 non-null object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [74]:
# Select a Series from a Dataframe
athlete = summer['Athlete']

In [75]:
type(athlete)

pandas.core.series.Series

In [76]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [77]:
# Check the Data tye - O means Object
athlete.dtype

dtype('O')

In [78]:
# Check Shape of Pandas Series
athlete.shape

(31165,)

In [79]:
# Describe the Series
athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [80]:
# Get the Minimum element and maximim element
print(athlete.min())
print(athlete.max())

AABYE, Edgar
STRAND, Per-Olof

In [81]:
print(len(athlete.unique()))

22762

In [82]:
athlete.nunique()

22762

In [83]:
# You can also use Value Counts here
athlete.value_counts()

PHELPS, Michael                   22
LATYNINA, Larisa                  18
ANDRIANOV, Nikolay                15
ONO, Takashi                      13
SHAKHLIN, Boris                   13
MANGIAROTTI, Edoardo              13
NURMI, Paavo                      12
THOMPSON, Jenny                   12
NEMOV, Alexei                     12
KATO, Sawao                       12
FISCHER, Birgit                   12
TORRES, Dara                      12
COUGHLIN, Natalie                 12
BIONDI, Matthew                   11
OSBURN, Carl Townsend             11
CASLAVSKA, Vera                   11
CHUKARIN, Viktor Ivanovich        11
LOCHTE, Ryan                      11
SPITZ, Mark                       11
LEWIS, Carl                       10
HALL, Gary Jr.                    10
VAN ALMSICK, Franziska            10
DITYATIN, Aleksandr               10
KELETI, Agnes                     10
ASTAKHOVA, Polina                 10
NAKAYAMA, Akinori                 10
SCHERBO, Vitaly                   10
GEREVICH, Aladar                  10
VAN GRUNSVEN, Anky                 9
VEZZALI, Valentina                 9
                                  ..
TAILLON, Jacinthe                  1
PORZIO, Francesco                  1
BARTLETT, Charles Henry            1
SUBE, Karola                       1
OIDOV, Zevegying                   1
TORIBIO, Simeon Galvez             1
RADONYAK, Yuri                     1
CHILMANOV, Arman                   1
GARCIA MARTURELL, Hermenegildo     1
CHALAMOVA, Elena                   1
ZAPRIANOV, Dimitar                 1
IGOROV, Andrei                     1
GATHERCOLE, Terence                1
LUNDE, Vibeke                      1
BACKHAUS, Robin James              1
COLOMBETTI, Bruna                  1
JACKS, Brian Albert Thomas         1
GRONMAN, Jouni Johannes            1
SUKNO, Goran                       1
SIMON, Harry E.                    1
YU, Sun Bok                        1
PARQUE, Jim                        1
MICHELOT, Roger                    1
MILCHEV, Mykola                    1
UNSWORTH, Laura                    1
SEUFERT, Christina                 1
SUSLINA, Inna                      1
CREUS, Julian                      1
BOXHALL, Arlene Nadine             1
ZALAZAR, Victor                    1
Name: Athlete, Length: 22762, dtype: int64

In [84]:
athlete.value_counts(normalize=False, sort=True, ascending=True, bins=None, dropna=True)

ZALAZAR, Victor                    1
BOXHALL, Arlene Nadine             1
CREUS, Julian                      1
SUSLINA, Inna                      1
SEUFERT, Christina                 1
UNSWORTH, Laura                    1
MILCHEV, Mykola                    1
MICHELOT, Roger                    1
PARQUE, Jim                        1
YU, Sun Bok                        1
SIMON, Harry E.                    1
SUKNO, Goran                       1
GRONMAN, Jouni Johannes            1
JACKS, Brian Albert Thomas         1
COLOMBETTI, Bruna                  1
BACKHAUS, Robin James              1
LUNDE, Vibeke                      1
GATHERCOLE, Terence                1
IGOROV, Andrei                     1
ZAPRIANOV, Dimitar                 1
CHALAMOVA, Elena                   1
GARCIA MARTURELL, Hermenegildo     1
CHILMANOV, Arman                   1
RADONYAK, Yuri                     1
TORIBIO, Simeon Galvez             1
OIDOV, Zevegying                   1
SUBE, Karola                       1
BARTLETT, Charles Henry            1
PORZIO, Francesco                  1
TAILLON, Jacinthe                  1
                                  ..
VEZZALI, Valentina                 9
VAN GRUNSVEN, Anky                 9
GEREVICH, Aladar                  10
SCHERBO, Vitaly                   10
NAKAYAMA, Akinori                 10
ASTAKHOVA, Polina                 10
KELETI, Agnes                     10
DITYATIN, Aleksandr               10
VAN ALMSICK, Franziska            10
HALL, Gary Jr.                    10
LEWIS, Carl                       10
SPITZ, Mark                       11
LOCHTE, Ryan                      11
CHUKARIN, Viktor Ivanovich        11
CASLAVSKA, Vera                   11
OSBURN, Carl Townsend             11
BIONDI, Matthew                   11
COUGHLIN, Natalie                 12
TORRES, Dara                      12
FISCHER, Birgit                   12
KATO, Sawao                       12
NEMOV, Alexei                     12
THOMPSON, Jenny                   12
NURMI, Paavo                      12
MANGIAROTTI, Edoardo              13
SHAKHLIN, Boris                   13
ONO, Takashi                      13
ANDRIANOV, Nikolay                15
LATYNINA, Larisa                  18
PHELPS, Michael                   22
Name: Athlete, Length: 22762, dtype: int64

In [85]:
# For Creating a Pandas series, we can select one row or one column
type(summer.Athlete)

pandas.core.series.Series

In [86]:
# One Row will also be a Series
type(summer.iloc[1])

pandas.core.series.Series

In [87]:
# Selecting only Particular Column from a CSV
pd.read_csv('summer.csv', usecols=['Athlete'], squeeze=True).head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [88]:
# Selecting a Sequence of Columns from a CSV
pd.read_csv('summer.csv', usecols=['Athlete', 'Medal'], squeeze=True).head()

              Athlete   Medal
0       HAJOS, Alfred    Gold
1    HERSCHMANN, Otto  Silver
2   DRIVAS, Dimitrios  Bronze
3  MALOKINIS, Ioannis    Gold
4  CHASAPIS, Spiridon  Silver

In [89]:
# Creating a Series from Scratch
pd.Series(data=[21,20,44,35,24,40], index=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'June'], name = "Profits")

Jan     21
Feb     20
Mar     44
Apr     35
May     24
June    40
Name: Profits, dtype: int64

### Indexing and Slicing - Titanic Dataset

In [90]:
# Already Age has been extracted from df(Titanic) dataset
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [95]:
# You Can Index and Slice a Series normally
print(age[0])
# print(age[-1]) -> Will not work as pandas dont know. So we use index based positioning - iloc
print(age.iloc[-1])
print(age[2])

22.0
32.0
26.0

In [98]:
# Sorting a Series

dic = {1:10, 3:34, 2:12, 5:23, 4:45,7:None, 6:42}
dic

{1: 10, 2: 12, 3: 34, 4: 45, 5: 23, 6: 42, 7: None}

In [99]:
# Converting a Dictionary to a Series
sales = pd.Series(dic)
sales

1    10.0
2    12.0
3    34.0
4    45.0
5    23.0
6    42.0
7     NaN
dtype: float64

In [101]:
# To Sort indexes, use
sales.sort_index(ascending= True) # By Default

1    10.0
2    12.0
3    34.0
4    45.0
5    23.0
6    42.0
7     NaN
dtype: float64

In [113]:
# To Sort indexes in Descending Order
sales.sort_index(ascending= True, inplace= False) # By Default

1    10.0
2    12.0
3    34.0
4    45.0
5    23.0
6    42.0
7     NaN
dtype: float64

In [114]:
sales

1    10.0
2    12.0
3    34.0
4    45.0
5    23.0
6    42.0
7     NaN
dtype: float64

In [115]:
# Inplace Not only changes the current one but also changes the Complete Root
sales.sort_index(ascending= False, inplace= True)

In [116]:
sales

7     NaN
6    42.0
5    23.0
4    45.0
3    34.0
2    12.0
1    10.0
dtype: float64

In [125]:
# You can also change the position of the NAN value
sales.sort_values(ascending= False, na_position= 'last', inplace= True)

In [126]:
sales

4    45.0
6    42.0
3    34.0
5    23.0
2    12.0
1    10.0
7     NaN
dtype: float64

In [128]:
# Sorting a Series

dic = {'Mon':10, 'Wed':34, 'Tue':12, 'Thu':23, 'Fri':45,'Sun':None, 'Sat':42}
dic

{'Fri': 45, 'Mon': 10, 'Sat': 42, 'Sun': None, 'Thu': 23, 'Tue': 12, 'Wed': 34}

In [129]:
sales_dic = pd.Series(dic)

In [131]:
# Sort Index in ascending Order
sales_dic.sort_index(ascending= True)

Fri    45.0
Mon    10.0
Sat    42.0
Sun     NaN
Thu    23.0
Tue    12.0
Wed    34.0
dtype: float64

In [132]:
# Sort Values in descending Order
sales_dic.sort_values(ascending= False)

Fri    45.0
Sat    42.0
Wed    34.0
Thu    23.0
Tue    12.0
Mon    10.0
Sun     NaN
dtype: float64